using System;

public class StaticWordProvider : IWordProvider
{
    private string[] words = new string[100];

    private string[] hints = new string[100];

    private int _wordCount = 0;
    private int _currentIndex = 0; 
    private Random _random = new Random();

    public StaticWordProvider()
    {
        
        words[0] = "алгоритм"; hints[0] = "Точна послідовність дій для досягнення результату";
        words[1] = "баг"; hints[1] = "Неочікувана помилка в коді, яку часто називають «фічею»";
        words[2] = "ноутбук"; hints[2] = "Портативний комп'ютер, який зручно брати з собою";
        words[3] = "процесор"; hints[3] = "Апаратний «мозок» комп'ютера";
        words[4] = "університет"; hints[4] = "Заклад, де здобувають вищу освіту та здають лаби";
        words[5] = "екзамен"; hints[5] = "Фінальна перевірка знань, яка змушує не спати ночами";
        words[6] = "бібліотека"; hints[6] = "Місце, де зберігається багато книг (або набір готового коду)";
        words[7] = "капібара"; hints[7] = "Найбільший гризун у світі, який завжди виглядає максимально спокійним";
        words[8] = "піца"; hints[8] = "Популярна італійська страва з тіста, сиру та начинок";
        words[9] = "океан"; hints[9] = "Величезний водний простір, що покриває більшу частину планети";
        words[10] = "велосипед"; hints[10] = "Екологічний двоколісний транспорт, де треба крутити педалі";
        words[11] = "гітара"; hints[11] = "Популярний струнний музичний інструмент";
        words[12] = "космонавт"; hints[12] = "Професія людини, яка літає за межі земної атмосфери";
        words[13] = "електрика"; hints[13] = "Енергія, без якої не буде працювати жоден гаджет";
        words[14] = "автомобіль"; hints[14] = "Транспортний засіб на чотирьох колесах із двигуном";
        words[15] = "сніданок"; hints[15] = "Ранковий прийом їжі, який дає енергію на весь день";

        _wordCount = 16;
    }

    public string GetWord()
    {
        _currentIndex = _random.Next(0, _wordCount);
        return words[_currentIndex];
    }

    public string GetHint()
    {
        return hints[_currentIndex];
    }
}